src/test/resources/mockdata/invoices/c0d08448-347b-418a-8c2f-5fb50248d67e.json

{
  "id": "c0d08448-347b-418a-8c2f-5fb50248d67e",
  "approvedBy": "ab18897b-0e40-4f31-896b-9c9adc979a88",
  "approvalDate": "2018-07-29T00:00:00.000+0000",
  "chkSubscriptionOverlap": false,
  "currency": "USD",
  "folioInvoiceNo": "123invoicenumber45",
  "invoiceDate": "2018-07-20T00:00:00.000+0000",
  "note": "Some note 1",
  "acquisitionsUnit": "d79b0bcc-DcAD-1E4E-Abb7-DbFcaD5BB3bb",
  "paymentTerms": "Payment in Advance",
  "paymentMethod": "EFT",
  "status": "Approved",
  "source": "024b6f41-c5c6-4280-858e-33fba452a334",
  "total": 5.0,
  "vendorInvoiceNo": "YK75851",
  "voucherNumber": "478",
  "paymentId": "a5065f0d-fb88-4d23-b0c1-57e754fba40e",
  "poNumbers": [
    "AB268758XYZ"
  ],
  "adjustments": [
    {
      "description": "Test adjustment",
      "type": "Percentage",
      "value": 10.1
    }
  ],
  "vendorId": "168f8a63-d612-406e-813f-c7527f241ac3",
  "manualPayment": true
}
